# Дан список размера N.
# Найти количество его промежутков монотонности.
a = list(map(int, input('Введите значение чисел через пробел: ').split()))  # ввод списка с клавиатуры
N = len(a)  # узнавание длины списка

down = 0
for i in range(1, len(a)):
    if a[i] < a[i-1] and a[i-1] >= a[i-2]:
        down += 1
print("Монотонные промежутки убывания:", down)

up = 0
for i in range(1, len(a)):
    if a[i] > a[i-1] and a[i-1] <= a[i-2]:
        up += 1
print("Монотонные промежутки возрастания:", up)

print("Всего промежутков монотонности", up+down)
